tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "awscli"
brew "azure-cli"
brew "direnv"
brew "docker-compose"
brew "doctl"
brew "fish"
brew "go"
brew "hey"
brew "htop"
brew "k3d"
brew "kustomize"
brew "libpq"
brew "openssl@3"
brew "poetry"
brew "pyenv"
brew "starship"
brew "stow"
brew "terraform"
brew "tmux"
brew "tree"
cask "bitwarden"
cask "eloston-chromium"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "iterm2"
cask "miniconda"
cask "slack"
cask "vscodium"
