tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "python@3.11"
brew "docutils"
brew "awscli"
brew "python@3.10"
brew "azure-cli"
brew "node"
brew "balena-cli"
brew "ccache"
brew "cmake"
brew "direnv"
brew "docker-compose"
brew "doctl"
brew "fish"
brew "git"
brew "git-lfs"
brew "libevent"
brew "go"
brew "gperf"
brew "hey"
brew "htop"
brew "jpeg"
brew "k3d"
brew "krb5"
brew "kubeseal"
brew "kustomize"
brew "libmagic"
brew "libpq"
brew "libtiff"
brew "little-cms2"
brew "ninja"
brew "openjpeg"
brew "openssl@1.1"
brew "virtualenv"
brew "poetry"
brew "pyenv"
brew "qemu"
brew "rust"
brew "starship"
brew "stow"
brew "terraform"
brew "theharvester"
brew "tmux"
brew "tree"
brew "webp"
brew "wget"
cask "bitwarden"
cask "docker"
cask "eloston-chromium"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "miniconda"
cask "slack"
cask "vscodium"
