tap "azure/kubelogin"
tap "charmbracelet/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "peak/tap"
tap "pulumi/tap"
tap "sst/tap"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "awscli"
brew "azure-cli"
brew "balena-cli"
brew "bat"
brew "ccache"
brew "cmake"
brew "deno"
brew "direnv"
brew "docker-compose"
brew "doctl"
brew "docutils"
brew "eza"
brew "fd"
brew "ripgrep"
brew "procs"
brew "dust"
brew "duf"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "zsh"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "goimports"
brew "gperf"
brew "helm"
brew "hey"
brew "htop"
brew "jpeg"
brew "just"
brew "k3d"
brew "krb5"
brew "kubeseal"
brew "kustomize"
brew "libmagic"
brew "libpq"
brew "llvm"
brew "minicom"
brew "ninja"
brew "node"
brew "ollama"
brew "openssl@1.1"
brew "pinentry-mac"
brew "pnpm"
brew "poetry"
brew "portaudio"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "qemu"
brew "rust"
brew "starship"
brew "stow"
brew "terraform"
brew "terraform-docs"
brew "theharvester"
brew "tree"
brew "uv"
brew "virtualenv"
brew "watchexec"
brew "wget"
brew "azure/kubelogin/kubelogin"
brew "charmbracelet/tap/crush"
brew "peak/tap/s5cmd"
brew "sst/tap/opencode"
cask "aws-vault-binary"
cask "bitwarden"
cask "docker-desktop"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "kitty"
cask "insomnia"
cask "iterm2"
cask "orbstack"
cask "slack"
cask "ungoogled-chromium"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "warp"
vscode "ahmadawais.shades-of-purple"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "robbowen.synthwave-vscode"
vscode "saoudrizwan.claude-dev"
vscode "vstirbu.vscode-mermaid-preview"
