# Taps
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "sst/tap"

# Modern CLI replacements
brew "bat"          # Better cat
brew "eza"          # Better ls
brew "fd"           # Better find
brew "ripgrep"      # Better grep
brew "procs"        # Better ps
brew "dust"         # Better du
brew "duf"          # Better df
brew "fzf"          # Fuzzy finder
brew "htop"         # Better top
brew "tree"         # Directory tree

# Shell & Terminal
brew "zsh"
brew "starship"     # Prompt
brew "direnv"       # Environment management

# Development essentials
brew "git"
brew "git-lfs"
brew "gh"           # GitHub CLI
brew "stow"         # Dotfiles management
brew "watchexec"    # File watcher
brew "just"         # Command runner

# Languages & Package managers
brew "node"
brew "pnpm"
brew "deno"
brew "go"
brew "gofumpt"      # Stricter Go formatter
brew "goimports"    # Go import management
brew "rust"
brew "uv"           # Fast Python toolchain (manages Python versions + packages)

# Cloud & Infrastructure
brew "awscli"
brew "azure-cli"
brew "doctl"        # DigitalOcean
brew "sst/tap/opencode"  # SST framework
brew "terraform"
brew "terraform-docs"
brew "helm"
brew "k3d"          # Local Kubernetes
brew "kubectl"      # Via homebrew/core
brew "kubeseal"
brew "kustomize"
brew "azure/kubelogin/kubelogin"

# Build tools
brew "cmake"
brew "ninja"
brew "ccache"       # Compiler cache

# Utilities
brew "gnupg"
brew "pinentry-mac"
brew "wget"
brew "ffmpeg"       # Media processing

# Applications
cask "kitty"                        # Terminal
cask "visual-studio-code"           # Editor
cask "vscodium"                     # Open-source VS Code
cask "orbstack"                     # Docker/Kubernetes
cask "bitwarden"                    # Password manager
cask "ungoogled-chromium"           # Privacy-focused browser
cask "slack"
cask "insomnia"                     # API client
cask "vlc"                          # Media player
cask "gcloud-cli"                   # Google Cloud
cask "aws-vault-binary"             # AWS credentials

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

# VS Code Extensions
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-python.python"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "github.github-vscode-theme"
